package math;

public class mainclass {

	public static void main(String[] args) {
		// 연산의 달인
		// 1. 더하기
		// 2. 빼기
		// 3. 곱하기
		// 4. 나누기
		// 0. 종료
		// 1 -> 더하기 문제가 10 문제 정도 나오고
		// 정답수 와 틀린수 를 출력 해주고 다시 위의 메뉴 출력
		// 그외 연산도 위와 같은 방식으로
		// 문자가 입력되면 예외처리까지 해보세요~
		// 힘들면 안해도 됨(예외처리는)
		// 전체적으로 할 수 있는데 까지 해봅니다.
		// 메인 메소드에는 최소한의 코드만 있고 for(;;)
		// 다 클래스에 매소드로 구현 해보세요~
		// 클래스는 도저히 만들기 힘드면 메인 메소드에 다 써놓고
		// 나중에 짤라내기 하는게 편할수 있다.
		
		class1 mm = new class1();
		mm.GameStart();
	}

}
